var street_data = {"data":[
				   [121.497136,31.285672, "曲阳街道"],
				   [121.498922,31.260509, "广灵街道"],
				   [121.47143,31.286432, "广中路街道"],
				   ],
				   "icon":["./icon/icon1.png"]
};

var police_data = {"data":[
				   [121.483037,31.290537, "曲阳街道"],
				   [121.477611,31.262235, "广灵街道"],
				   [121.521304,31.295937, "广中路街道"],
				   ],
				   "icon":["./icon/icon2.png"]
};

var center_data = {"data":[
				   [121.49299,31.251986, "曲阳街道"],
				   [121.473443,31.257543, "广灵街道"],
				   [121.507794,31.27347, "广中路街道"],
				   ],
				   "icon":["./icon/icon3.png"]
};

