var street_data = {"data":[
				   [121.497136,31.285672, "曲阳街道"],
				   [121.498922,31.260509, "广灵街道"],
				   [121.47143,31.286432, "广中路街道"],
				   ],
				   "icon":["./icon/icon1.png"]
};

var police_data = {"data":[
				   [121.497136,32.285672, "曲阳街道"],
				   [121.498922,32.260509, "广灵街道"],
				   [121.47143,32.286432, "广中路街道"],
				   ],
				   "icon":["./icon/icon2.png"]
};

var center_data = {"data":[
				   [121.497136,33.285672, "曲阳街道"],
				   [121.498922,33.260509, "广灵街道"],
				   [121.47143,33.286432, "广中路街道"],
				   ],
				   "icon":["./icon/icon3.png"]
};

