var street_data = {"data":[
				   [121.497136,31.285672, "曲阳街道", "64331920", "四川北路2288号（虹口足球场旁）"],
				   [121.498922,31.260509, "广灵街道", "25658888","虹口区飞虹路518号"],
				   [121.47143,31.286432, "广中路街道", "(021)65512410","上海市杨浦区安波路139号"],
				   ],
				   "type":["street"],
				   "icon":["./icon/icon1.png"]
};

var police_data = {"data":[
				   [121.483037,31.290537, "曲阳派出所", "(021)65422593", "汾西路580号（近平顺路）"],
				   [121.477611,31.262235, "广灵派出所", "(021)65290133, (021)65299547", "凉城路800号（近车站北路）"],
				   [121.521304,31.295937, "广中派出所", "(021)55250958", "政悦路430号（殷行路政悦路）"],
				   ],
				   "type":["police"],
				   "icon":["./icon/icon2.png"]
};

var center_data = {"data":[
				   [121.49299,31.251986, "曲阳社保中心", "(021)56045199, (021)36621019", "上海市宝山区顾村镇沪太路4788号"],
				   [121.473443,31.257543, "广灵社保中心", "(021)66161686", "祁连山路聚丰园路155号"],
				   [121.507794,31.27347, "广中社保中心", "021-66050000", "上海市闸北区中山北路1015号"],
				   ],
				   "type":["center"],
				   "icon":["./icon/icon3.png"]
};

var data_list = [];
data_list.push(street_data);
data_list.push(police_data);
data_list.push(center_data);

